import re


def normalize_text(text):

    text = text.strip().lower()

    # إزالة علامات الترقيم
    text = re.sub(r"[؟?!،,.]", "", text)

    # إزالة المسافات الزائدة
    text = re.sub(r"\s+", " ", text)

    replacements = {

        # الضريبة
        "الضرايب": "الضريبة",
        "الضرائب": "الضريبة",
        "الضريبه": "الضريبة",
        "ضرايب": "الضريبة",
        "ضريبه": "الضريبة",

        # الأوفر تايم
        "الاوفر تايم": "الأوفر تايم",
        "اوفر تايم": "الأوفر تايم",
        "اوفرتايم": "الأوفر تايم",
        "الاوفر تام": "الأوفر تايم",
        "الاوفر تيم": "الأوفر تايم",
        "الأوفر": "الأوفر تايم",
        "الاوفر": "الأوفر تايم",

        # البونص
        "بونص": "البونص",
        "البونس": "البونص",
        "بونس": "البونص",

        # الراتب
        "المرتب": "الراتب",
        "القبض": "الراتب",

        # صافي الراتب
        "النت": "صافي الراتب",
        "الصافى": "صافي الراتب",
        "الصافي": "صافي الراتب",

        # كلمات المحادثة
        "ازاي": "إزاي",
        "مع ان": "مع إن"
    }

    for old, new in replacements.items():

        text = text.replace(old, new)

    # تنظيف المسافات مرة أخرى
    text = re.sub(r"\s+", " ", text).strip()

    return text